app/Controllers/Kantor.php

    public function tampil() {
        $kantor = new KantorModel();
        // Mengambil semua data di tabel kantor dan kecamatan menggunakan JOIN
        $data['query'] = $kantor->join('kecamatan', 'kecamatan.kode_kecamatan = kantor.kode_kecamatan')->findAll();
---
SELECT *
FROM `kantor`
JOIN `kecamatan` ON `kecamatan`.`kode_kecamatan` = `kantor`.`kode_kecamatan`

    public function tambah() {
        $kecamatan = new KecamatanModel();
        $kecamatan = $kecamatan->findAll();
---
SELECT *
FROM `kecamatan`

    public function simpan() {
        $kantor = new KantorModel();
        // Mengambil data dari masing-masing input pada form tambah
        // dan disimpan pada array untuk disimpan ke tabel kantor
        $data_kantor = [
            'kode_pos' => $this->request->getVar('kode_pos'),
            'kode_kecamatan' => $this->request->getVar('kode_kecamatan'),
            'alamat_kantor' => $this->request->getVar('alamat_kantor'),
            'koordinat' => $this->request->getVar('koordinat')
        ];
        // Menggunakan query builder insert untuk menyimpan ke tabel kantor
        $kantor->insert($data_kantor);
---
INSERT INTO `kantor` (`kode_pos`, `kode_kecamatan`, `alamat_kantor`, `koordinat`) VALUES ('53121', '3302740', 'Jl. Prof. Dr. H.R Boenyamin No. 03, Glempang, Bancarkembar, Kec. Purwokerto Utara, Kabupaten Banyumas, Jawa Tengah ', '-7.4162155,109.2419509')